Revit 2027 API
Duct.IsDuctTypeId Method
 Checks if given type is valid duct type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDuctTypeId(
	Document document,
	ElementId ductTypeId
)
Public Shared Function IsDuctTypeId (
	document As Document,
	ductTypeId As ElementId
) As Boolean
public:
static bool IsDuctTypeId(
	Document^ document,
	ElementId^ ductTypeId
)
static member IsDuctTypeId :
        document : Document *
        ductTypeId : ElementId -> bool
Parameters
document Document
 The document.
ductTypeId ElementId
 ElementId of the duct type to check.
Return Value
Boolean
 True if duct type can used for this duct, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A type is valid for duct if it can be used to the duct element.
See Also
Reference
Duct Class
Autodesk.Revit.DB.Mechanical Namespace